# DCIT 311 LAB 3

In [78]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.preprocessing import MinMaxScaler
df = pd.read_csv('train.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# Data exploration

In [80]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [81]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [82]:
df.columns.tolist()

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [83]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [84]:
# df = df.drop(columns=['ID'])
# df

In [85]:
# df.columns.tolist()
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [86]:
plt.figure(figsize=(20,16))
sns.heatmap(df.corr(), annot=True, cmap='coolwarm')
plt.title('Boston correlation graph')
plt.show()

ValueError: could not convert string to float: 'Braund, Mr. Owen Harris'

# Data Pre-processing

# Scaling the data set

In [ ]:
scaler = MinMaxScaler()
# Features to be scaled
standardize_features = ['crim', 'zn', 'indus', 'nox', 'rm', 'age', 'dis', 'rad', 'tax', 'ptratio', 'black', 'lstat', 'medv']
df_scaled = scaler.fit_transform(df[standardize_features])
pd.DataFrame(df_scaled, columns= standardize_features)
df[standardize_features]= df_scaled
df

In [ ]:
df.describe()

In [ ]:
df.info()

In [ ]:
df.isnull().sum()

# Training the linear regression model

In [ ]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_squared_error,r2_score

In [ ]:
X=df[['rm']]
Y=df[['medv']]

In [ ]:
X_train,X_test,Y_train,Y_test = train_test_split(X,Y, test_size=0.2, random_state=42)

In [ ]:
model = LinearRegression()
model.fit(X_train,Y_train)

In [ ]:
predicting_y = model.predict(X_test)
predicting_y

In [ ]:
predicting_y1 = model.predict([[0.583656]])
predicting_y1

In [ ]:
plt.scatter(X_test,Y_test, color='blue', label='predicted values')
plt.plot(X_test,predicting_y, color='red', label='true values')
plt.xlabel('rem: average number of rooms')
plt.ylabel('medv: median home values')
plt.title('actual vs predicted Home values using average of rooms ...')
plt.legend()
plt.grid(True)
plt.show()

# Calculating the error of Linear Regression

In [ ]:
mse = mean_squared_error(Y_test,predicting_y)
r2= r2_score(Y_test, predicting_y)
print(f"mean squared error is : {mse}")
print(f"R squared error is : {r2}")

# Multiple regression model

In [ ]:
X_train,X_test,Y_train,Y_test=train_test_split(df.drop(columns=['medv']),df['medv'], test_size=0.2, random_state=42)

In [ ]:
model = LinearRegression()
model.fit(X_train,Y_train)

In [ ]:
pred_y= model.predict(X_test)
pred_y

In [ ]:
plt.figure(figsize=(8, 6))
plt.scatter(Y_test, pred_y, color='blue', label='Predicted value', alpha=0.7)
plt.plot([min(Y_test), max(Y_test)], [min(Y_test), max(Y_test)], color='red', label='True value')
plt.title('Actual vs Predicted Values Using All Other Features')
plt.legend()
plt.xlabel('Actual Values')
plt.ylabel('Predicted Values')
plt.grid(True)
plt.show()

# Cacluating error of multiple regression

In [ ]:
mse = mean_squared_error(Y_test,pred_y)
r2= r2_score(Y_test, pred_y)
print(f"mean squared error is : {mse}")
print(f"R squared error is : {r2}")

In [102]:

# Assuming your features are in X and target in y

from sklearn.model_selection import cross_val_score
from sklearn.linear_model import LinearRegression

# Initialize the linear regression model
linear_reg = LinearRegression()

# Perform 5-fold cross-validation for Linear Regression
cv_scores_linear = cross_val_score(linear_reg, X, Y, cv=5, scoring='r2')

# Print the results
print("Cross-Validation R^2 Scores for Linear Regression:", cv_scores_linear)
print("Mean R^2 Score:", cv_scores_linear.mean())

NameError: name 'X' is not defined